Revit 2024 API
VertexFormat.IsValid Method
 Tests whether the vertex format specification is valid for rendering.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool IsValid()
Visual Basic
Public Function IsValid As Boolean
Visual C++
public:
bool IsValid()
Return Value
 True if the vertex format specification is valid for rendering, false otherwise.
Remarks
 The vertex format specifications are internally associated with low-level graphics state and may become invalidated when the state changes. Therefore, an application should test each vertex format object for validity before using it when submitting geometry. If the vertex format object becomes invalid, the application should re-create it.
See Also
VertexFormat Class
Autodesk.Revit.DB.DirectContext3D Namespace